# ---- Часть а ----
A <- matrix(c(1, 0, 0, 2, 0, 3, 1, 4, 2, 0, 3, 5), nrow = 3, byrow = TRUE)
A_transposed <- t(A)

cat("Размерности матрицы A:", dim(A), "\n") 
cat("Размерности транспонированной матрицы A:", dim(A_transposed), "\n")

cat("Первая строка A:", A[1, ], "\n")
cat("Вторая строка A:", A[2, ], "\n")
cat("Третья строка A:", A[3, ], "\n")
cat("Первый столбец A:", A[, 1], "\n")
cat("Второй столбец A:", A[, 2], "\n")
cat("Третий столбец A:", A[, 3], "\n")
cat("Четвертый столбец A:", A[, 4], "\n")

# ---- Часть б ----

A <- matrix(c(1, 3, 5, 1), nrow = 4, byrow = FALSE)
A_transposed <- t(A)

cat("Размерности матрицы A:", dim(A), "\n")
cat("Размерности транспонированной матрицы A:", dim(A_transposed), "\n")

cat("Первая строка A:", A[1, ], "\n")
cat("Вторая строка A:", A[2, ], "\n")
cat("Третья строка A:", A[3, ], "\n")
cat("Третья строка A:", A[4, ], "\n")